class Urls():
    url_main = 'https://qa-scooter.praktikum-services.ru/'
    url_order = 'https://qa-scooter.praktikum-services.ru/order'
    url_dzen = 'https://dzen.ru/?yredirect=true'

class Order():
    order_name = ['Александр', 'Николай']
    order_surname = ['Пушкин', 'Гоголь']
    order_address = ['Льва Толстого, 16', 'Проспект Мира, 121']
    order_phone = ['89990001122', '+09090977765']
    order_comment = 'Тестовый комментарий для заказа'
    order_1 = [order_name[0], order_surname[0], order_address[0], order_phone[0], order_comment]
    order_2 = [order_name[1], order_surname[1], order_address[1], order_phone[1], order_comment]
    order_success = 'Заказ оформлен'

class FAQ():
    answer_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    answer_2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    answer_3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    answer_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    answer_5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    answer_6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    answer_7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    answer_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

    answers = [answer_1, answer_2, answer_3, answer_4, answer_5, answer_6, answer_7, answer_8]
